#include "ythtlib.h"
#include "bbs.h"
#include "sysrecord.c"


#define	BOARD		"square"
#define MEDAL		MY_BBS_HOME "/bbstmpfs/tmp/medal.html"
#define MEDALPOST	MY_BBS_HOME "/vote/" BOARD "/notes"
#define FEED		"http://info.2008.sohu.com/Medal/Standings.shtml"

struct medallist {
    char name[14];
    int order;
    char gold[4];
    char silver[4];
    char copper[4];
    char total[4];
};

struct tvlist_item {
    int date;
    int hour;
    int minute;
    int cctv;
    char title[32];
} tvlist[] = {
{9, 5, 55, 7, "女子足球预赛精选"}, 
{9, 8, 35, 7, "开幕式"}, 
{9, 9, 0, 2, "女篮A组"}, 
{9, 9, 59, 5, "女子举重48公斤级决赛抓举"}, 
{9, 10, 0, 0, "女篮A组"}, 
{9, 10, 28, 1, "女子10米气步枪决赛"}, 
{9, 10, 48, 5, "女子举重48公斤级决赛挺举"}, 
{9, 11, 0, 2, "男子公路自行车发车情况"}, 
{9, 11, 3, 1, "女子10米气步枪颁奖仪式"}, 
{9, 11, 35, 7, "女子足球预赛"}, 
{9, 11, 48, 5, "女子举重48公斤级决赛颁奖仪式"}, 
{9, 12, 0, 2, "男子体操资格赛第一场"}, 
{9, 12, 30, 0, "女排B组第01场"}, 
{9, 13, 20, 1, "女子佩剑个人1/4决赛"}, 
{9, 13, 45, 7, "男子足球预赛"}, 
{9, 13, 50, 1, "赛艇女子单人双桨预赛"}, 
{9, 14, 30, 5, "女篮第3场B组"}, 
{9, 14, 30, 2, "女子排球A组03场"}, 
{9, 15, 0, 1, "男子10米气手枪决赛"}, 
{9, 15, 15, 7, "开幕式"}, 
{9, 15, 34, 1, "男子10米气手枪决赛颁奖仪式"}, 
{9, 15, 59, 1, "男子体操资格赛"}, 
{9, 16, 5, 2, "男子公路自行车冲刺阶段的实况"}, 
{9, 18, 0, 0, "女子柔道-48公斤级和男子柔道-60公"}, 
{9, 18, 15, 7, "体操男子团体资格赛"}, 
{9, 19, 0, 5, "女子佩剑半决赛1+2"}, 
{9, 19, 49, 5, "女子佩剑铜牌，金牌决赛"}, 
{9, 20, 0, 2, "女篮B组"}, 
{9, 20, 0, 1, "女排小组赛"}, 
{9, 20, 0, 0, "射击女子10米气步枪决赛、射击男子"}, 
{9, 20, 39, 5, "女子佩剑决赛颁奖仪式"}, 
{9, 21, 0, 2, "女篮B组"}, 
{9, 21, 50, 7, "女子篮球预赛"}, 
{9, 22, 0, 2, "女子排球B组预赛第3场"}, 
{10, 0, 20, 7, "开幕式"}, 
{10, 3, 15, 7, "女子足球预赛"}, 
{10, 4, 0, 7, "女子足球预赛"}, 
{10, 4, 50, 7, "赛事集锦9"}, 
{10, 6, 30, 7, "赛事集锦10"}, 
{10, 8, 0, 2, "男篮A组"}, 
{10, 8, 0, 7, "赛事集锦1"}, 
{10, 9, 0, 5, "男沙B组第7场"}, 
{10, 9, 0, 2, "男篮A组"}, 
{10, 9, 35, 7, "女子足球预赛"}, 
{10, 9, 45, 1, "男子400米个人混合泳决赛"}, 
{10, 10, 0, 5, "女子体操资格赛"}, 
{10, 10, 9, 1, "女子100米蝶泳决赛"}, 
{10, 10, 20, 1, "男子400米自由泳决赛"}, 
{10, 10, 28, 1, "男子400米个人混合泳颁奖仪式"}, 
{10, 10, 38, 1, "女子400米个人混合泳决赛"}, 
{10, 10, 45, 2, "羽毛球女单、女双"}, 
{10, 10, 47, 1, "男子400米自由泳颁奖仪式"}, 
{10, 11, 7, 1, "女子4OO米个人混合泳颁奖仪式"}, 
{10, 11, 17, 1, "女子4x100米自由泳接力决赛"}, 
{10, 11, 28, 1, "女子4x100米自由泳接力颁奖仪式"}, 
{10, 12, 0, 5, "女子气手枪决赛"}, 
{10, 12, 0, 2, "女子团体射箭1/4决赛"}, 
{10, 12, 15, 7, "女子排球预赛"}, 
{10, 12, 32, 1, "男排：美国-委内瑞拉"}, 
{10, 12, 35, 5, "女子气手枪决赛颁奖仪式"}, 
{10, 13, 25, 2, "拳击轻中量级(64公斤级)"}, 
{10, 13, 30, 5, "体操女子资格赛"}, 
{10, 13, 55, 7, "赛事集锦1"}, 
{10, 14, 0, 2, "女子公路自行车发车情况"}, 
{10, 14, 7, 2, "男子水球预赛"}, 
{10, 14, 15, 1, "女子双人3米跳板决赛"}, 
{10, 15, 0, 5, "男子飞碟多项决赛"}, 
{10, 15, 20, 2, "女子举重53公斤级"}, 
{10, 15, 25, 0, "射击女子10米气手枪决赛、女子曲棍"}, 
{10, 15, 30, 1, "女子双人3米板决赛颁奖仪式"}, 
{10, 15, 45, 1, "赛艇预赛"}, 
{10, 15, 59, 5, "射箭女子团体半决赛"}, 
{10, 16, 40, 1, "男篮A组小组赛"}, 
{10, 16, 51, 5, "射箭女子团体铜牌决赛"}, 
{10, 17, 0, 0, "体操女子团体资格赛、游泳决赛"}, 
{10, 17, 15, 2, "女子公路自行车冲刺"}, 
{10, 17, 20, 5, "射箭女子团体决赛"}, 
{10, 17, 35, 2, "男足"}, 
{10, 17, 46, 1, "男篮A组小组赛"}, 
{10, 17, 49, 5, "射箭女子团体颁奖仪式"}, 
{10, 18, 0, 2, "男足"}, 
{10, 18, 23, 2, "女子柔道-52公斤级"}, 
{10, 19, 36, 1, "男子举重56公斤级A组决赛"}, 
{10, 19, 38, 5, "中国男足小组赛第二场上半场"}, 
{10, 19, 50, 2, "男子排球"}, 
{10, 20, 0, 0, "跳水女子双人3米板决赛、举重女子"}, 
{10, 20, 47, 5, "中国男足小组赛第二场下半场"}, 
{10, 20, 50, 1, "男子举重56公斤级A组决赛颁奖仪式"}, 
{10, 21, 42, 1, "录像:体操女团资格赛"}, 
{10, 22, 0, 0, "射击男子飞碟多项决赛、柔道女子"}, 
{10, 22, 0, 2, "男篮B组上半场"}, 
{10, 23, 10, 7, "男子足球预赛"}, 
{10, 23, 15, 2, "男篮B组下半场"}, 
{11, 1, 45, 7, "男子水球预赛"}, 
{11, 3, 35, 7, "女子曲棍球预赛"}, 
{11, 4, 0, 7, "女子曲棍球预赛"}, 
{11, 4, 40, 7, "男子手球预赛"}, 
{11, 5, 40, 7, "男子排球预赛"}, 
{11, 6, 40, 7, "男子篮球预赛中国队-美国队"}, 
{11, 6, 40, 7, "男子篮球预赛中国队-美国队"}, 
{11, 8, 0, 2, "女篮B组"}, 
{11, 8, 0, 7, "赛事集锦3"}, 
{11, 8, 30, 5, "男曲预赛A组"}, 
{11, 9, 0, 2, "女篮B组"}, 
{11, 9, 35, 7, "北京奥运会篮球、举重等"}, 
{11, 9, 45, 1, "女子100米仰泳半决赛"}, 
{11, 10, 0, 5, "羽毛球女双1/4决赛"}, 
{11, 10, 10, 1, "男子200米自由泳半决赛"}, 
{11, 10, 21, 1, "女子100米蝶泳决赛"}, 
{11, 10, 27, 1, "男子100米蛙泳决赛"}, 
{11, 10, 33, 1, "女子100米蛙泳半决赛"}, 
{11, 10, 43, 1, "女子100米蝶泳颁奖仪式"}, 
{11, 10, 53, 1, "男子100米仰泳半决赛"}, 
{11, 10, 55, 2, "女子沙滩排球C组"}, 
{11, 11, 24, 1, "女子400米自由泳决赛"}, 
{11, 11, 45, 5, "男子10米气步枪决赛"}, 
{11, 11, 55, 0, "女子排球预赛哈萨克斯坦队-意大利"}, 
{11, 12, 34, 5, "男子气步枪决赛颁奖仪式"}, 
{11, 12, 50, 0, "羽毛球女单前16名、女子双打1/4决"}, 
{11, 13, 0, 7, "跳水、击剑、曲棍球等"}, 
{11, 13, 35, 5, "拳击57公斤级预赛、帆板"}, 
{11, 14, 15, 1, "女篮A组小组赛"}, 
{11, 14, 25, 2, "女子排球预赛巴西队-俄罗斯队"}, 
{11, 14, 30, 5, "女子个人"}, 
{11, 15, 0, 5, "女子飞碟多向决赛"}, 
{11, 15, 45, 5, "女子举重58公斤级决赛抓举"}, 
{11, 16, 0, 2, "女子单人双桨1/4决赛"}, 
{11, 16, 6, 2, "皮划艇男子单人皮艇预赛"}, 
{11, 16, 25, 5, "女子举重58公斤级决赛挺举"}, 
{11, 16, 45, 1, "女篮A组小组赛"}, 
{11, 16, 50, 7, "举重、射击、游泳、跳水等"}, 
{11, 16, 52, 2, "皮划艇男子单人划艇预赛"}, 
{11, 17, 19, 5, "射箭男子团体决赛"}, 
{11, 17, 35, 1, "女篮A组小组赛"}, 
{11, 17, 50, 2, "女子柔道-57公斤级"}, 
{11, 18, 50, 5, "男子举重62公斤级决赛抓举"}, 
{11, 19, 45, 2, "女篮"}, 
{11, 19, 55, 5, "男子举重62公斤级决赛挺举"}, 
{11, 20, 1, 1, "中国女排小组赛第二场"}, 
{11, 20, 20, 0, "举重女子58公斤级决赛、射击女子飞"}, 
{11, 20, 49, 5, "男子举重62公斤级决赛颁奖仪式"}, 
{11, 21, 0, 2, "女篮"}, 
{11, 21, 5, 0, "羽毛球女子单打前16名、女子双打"}, 
{11, 21, 50, 7, "水球、举重、射箭等"}, 
{11, 21, 55, 0, "女子排球A组预赛第6场"}, 
{11, 22, 30, 5, "奥运会荣誉殿堂3"}, 
{12, 8, 0, 2, "男篮A组"}, 
{12, 9, 50, 5, "男子体操团体决赛"}, 
{12, 9, 59, 1, "女子200米自由泳半决赛"}, 
{12, 10, 0, 2, "男篮A组"}, 
{12, 10, 13, 1, "男子200米自由泳决赛"}, 
{12, 10, 20, 1, "男子200米自由泳决赛"}, 
{12, 10, 34, 1, "男子200米自由泳决赛颁奖仪式"}, 
{12, 10, 45, 1, "女子100米蛙泳决赛"}, 
{12, 11, 0, 2, "女子沙滩排球D组"}, 
{12, 11, 1, 1, "男子200米蝶泳半决赛"}, 
{12, 11, 13, 1, "男子100米仰泳决赛颁奖仪式"}, 
{12, 11, 23, 1, "女子200米个人混合泳半决赛"}, 
{12, 11, 35, 1, "女子100米蛙泳决赛颁奖仪式"}, 
{12, 11, 50, 2, "射击：男子50米手枪慢射决赛"}, 
{12, 12, 30, 7, "击剑、举重、跳水、射击等"}, 
{12, 12, 41, 5, "男子体操团体决赛颁奖仪式"}, 
{12, 14, 15, 1, "女子双人10米跳"}, 
{12, 14, 40, 5, "男子手球中国-"}, 
{12, 14, 50, 2, "射击：男子飞碟双多向决赛"}, 
{12, 15, 20, 5, "女子举重63公斤级决赛抓举"}, 
{12, 15, 30, 1, "女子双人10米"}, 
{12, 15, 45, 7, "体操、游泳、跳水等"}, 
{12, 16, 23, 5, "女子举重63公斤级决赛"}, 
{12, 16, 35, 1, "男篮B组小组赛"}, 
{12, 16, 50, 2, "垒球：中国-荷兰"}, 
{12, 17, 20, 5, "男子摔跤古典式55公斤级决赛"}, 
{12, 17, 46, 1, "男篮B组小组赛"}, 
{12, 18, 50, 5, "男子举重69公斤级决赛抓举"}, 
{12, 19, 0, 2, "女子柔道-63公斤级"}, 
{12, 19, 36, 1, "女足小组赛"}, 
{12, 19, 50, 2, "男排"}, 
{12, 19, 54, 5, "男子举重69公斤级决赛挺举"}, 
{12, 20, 46, 1, "女足小组赛"}, 
{12, 20, 50, 5, "男子举重69公斤级决赛颁奖仪式"}, 
{12, 22, 10, 0, "男篮A组"}, 
{12, 22, 15, 1, "全景奥运4"}, 
{12, 22, 30, 5, "奥运会荣誉殿堂4"}, 
{12, 23, 15, 0, "男篮A组"}, 
{13, 9, 45, 1, "男子100米自由泳半决赛"}, 
{13, 9, 50, 0, "女子双打半决赛、女子单打1/4决赛"}, 
{13, 9, 50, 5, "女子体操团体决赛"}, 
{13, 10, 11, 1, "女子200米自由泳决赛"}, 
{13, 10, 18, 1, "男子200米蝶泳决赛"}, 
{13, 10, 25, 1, "女子200米蝶泳半决赛"}, 
{13, 10, 37, 1, "女子200米自由泳颁奖仪式"}, 
{13, 10, 47, 1, "男子200米蛙泳半决赛"}, 
{13, 10, 59, 1, "男子200米蝶泳颁奖仪式"}, 
{13, 11, 9, 1, "女子200米个人混合泳决赛决赛"}, 
{13, 11, 16, 1, "男子4/200米自由泳接力决赛"}, 
{13, 12, 4, 5, "颁奖仪式"}, 
{13, 12, 30, 7, "体操、射击、足球等"}, 
{13, 12, 32, 1, "男子个人"}, 
{13, 13, 55, 2, "女子排球A组09场"}, 
{13, 14, 15, 1, "男子双人3米跳板决赛"}, 
{13, 14, 45, 5, "女子25米运动手枪决赛"}, 
{13, 15, 25, 5, "女子举重69公斤级决赛抓举"}, 
{13, 15, 34, 1, "男子双人3米板决赛颁奖仪式"}, 
{13, 15, 45, 2, "女子手球"}, 
{13, 15, 55, 1, "女子个人重剑1/4决赛"}, 
{13, 16, 25, 5, "女子举重69公斤级决赛挺举"}, 
{13, 16, 35, 7, "举重、游泳、跳水等"}, 
{13, 16, 45, 1, "女篮B组小组赛"}, 
{13, 17, 15, 2, "网球：男女单打第三轮，男女双打"}, 
{13, 17, 19, 5, "女子举重69公斤级决赛颁奖仪式"}, 
{13, 17, 45, 1, "女篮B组小组赛"}, 
{13, 18, 25, 5, "羽毛球女单1/4决赛"}, 
{13, 18, 50, 2, "女子柔道-70公斤级"}, 
{13, 19, 36, 1, "女子排球预赛中国队-"}, 
{13, 19, 45, 5, "中国男足小组赛第三场上半场"}, 
{13, 20, 0, 2, "女篮A组"}, 
{13, 20, 45, 5, "中国男足小组赛第二场下半场"}, 
{13, 21, 0, 2, "女篮A组"}, 
{13, 21, 31, 1, "女子个人重剑决赛"}, 
{13, 22, 0, 2, "录像：13日乒乓球集锦"}, 
{13, 22, 15, 1, "全景奥运5"}, 
{13, 22, 30, 5, "奥运会荣誉殿堂5"}, 
{14, 8, 0, 0, "男篮B组"}, 
{14, 8, 30, 5, "女曲预赛A组中国-荷兰"}, 
{14, 9, 45, 1, "男子200米蛙泳决赛"}, 
{14, 10, 0, 0, "男篮B组"}, 
{14, 10, 6, 1, "女子100米自由泳半决赛"}, 
{14, 10, 17, 1, "男子200米仰泳半决赛"}, 
{14, 10, 28, 1, "男子200米蛙泳决赛颁奖仪式"}, 
{14, 10, 38, 1, "女子200米蝶泳决赛"}, 
{14, 10, 45, 1, "男子100米自由泳决赛"}, 
{14, 10, 45, 5, "男子体操个人全能决赛"}, 
{14, 10, 45, 0, "男子单打1/4决赛，混合双打1/4决赛"}, 
{14, 10, 52, 1, "女子200米蛙泳半决赛"}, 
{14, 11, 18, 1, "女子200米蝶泳决赛颁奖仪式"}, 
{14, 11, 28, 1, "女子4x200米自由泳接力决赛"}, 
{14, 12, 32, 1, "射击女子步枪3x20决赛"}, 
{14, 13, 4, 1, "射击女子步枪3x20决赛颁奖仪式"}, 
{14, 13, 10, 0, "女子佩剑团体半决赛(视比赛情况而"}, 
{14, 13, 26, 1, "录像:乒乓球男子团体"}, 
{14, 13, 41, 5, "男子体操个人全能决赛颁奖仪式"}, 
{14, 13, 53, 1, "录像:乒乓球女子团体"}, 
{14, 14, 20, 5, "男篮"}, 
{14, 14, 30, 1, "乒乓球团体第2轮"}, 
{14, 14, 50, 2, "女子飞碟双向决赛"}, 
{14, 15, 20, 5, "男篮"}, 
{14, 15, 50, 2, "男子手球"}, 
{14, 16, 40, 7, "羽毛球、游泳、跳水等"}, 
{14, 16, 55, 1, "女子射箭个人半决赛"}, 
{14, 17, 50, 2, "女子佩剑团体铜牌争夺战"}, 
{14, 17, 55, 1, "女子射箭个人决赛"}, 
{14, 18, 25, 5, "羽毛球男单1/4决赛"}, 
{14, 19, 0, 2, "女子佩剑团体决赛"}, 
{14, 19, 36, 1, "乒乓球女团第三轮"}, 
{14, 20, 5, 2, "男篮B组"}, 
{14, 20, 53, 1, "录像:乒乓球男团第三轮1"}, 
{14, 21, 0, 2, "男篮B组"}, 
{14, 21, 38, 1, "录像:乒乓球男团第三轮2"}, 
{14, 22, 0, 2, "马术：盛装舞步团体"}, 
{14, 22, 15, 1, "全景奥运6"}, 
{14, 22, 30, 5, "奥运会荣誉殿堂6"}, 
{15, 8, 30, 5, "男曲预赛中国-西班牙"}, 
{15, 9, 0, 1, "沙滩排球女子前16名复赛"}, 
{15, 9, 50, 2, "女子单打半决赛，男子双打半决赛"}, 
{15, 10, 0, 1, "男子50米自由泳半决赛"}, 
{15, 10, 9, 1, "女子200米蛙泳决赛"}, 
{15, 10, 9, 1, "男子200米个人混合泳决赛"}, 
{15, 10, 9, 1, "女子200米蛙泳颁奖仪式"}, 
{15, 10, 9, 1, "男子200米仰泳决赛"}, 
{15, 10, 9, 1, "女子200米仰泳半决赛"}, 
{15, 10, 45, 5, "女子体操个人全能决赛"}, 
{15, 11, 1, 1, "男子200米个人混合泳颁奖仪式"}, 
{15, 11, 1, 1, "女子100米自由泳决赛"}, 
{15, 11, 1, 1, "男子100米蝶泳半决赛"}, 
{15, 11, 59, 1, "羽毛球女双颁奖仪式"}, 
{15, 11, 59, 1, "羽毛球女双3-4名"}, 
{15, 11, 59, 1, "羽毛球女双决赛"}, 
{15, 11, 59, 1, "羽毛球男单半决赛"}, 
{15, 13, 4, 5, "女子体操个人全能决赛颁奖仪式"}, 
{15, 13, 50, 2, "男子重剑团体半决赛"}, 
{15, 14, 20, 1, "乒乓球女团半决赛"}, 
{15, 14, 25, 5, "女排"}, 
{15, 15, 30, 2, "女子举重75公斤级"}, 
{15, 15, 50, 7, "跳水、游泳等"}, 
{15, 16, 0, 5, "网球女双半决赛"}, 
{15, 16, 30, 1, "女篮B组小组赛"}, 
{15, 17, 20, 2, "射箭男子个人铜牌争夺"}, 
{15, 17, 37, 2, "射箭男子个人决赛"}, 
{15, 17, 45, 1, "女篮B组小组赛"}, 
{15, 17, 50, 2, "女子柔道78公斤级"}, 
{15, 19, 20, 5, "乒乓球女团半决赛"}, 
{15, 19, 45, 2, "女子排球"}, 
{15, 22, 10, 2, "女篮A组"}, 
{15, 22, 15, 1, "全景奥运7"}, 
{15, 22, 30, 5, "奥运会荣誉殿堂7"}, 
{15, 23, 15, 2, "女篮A组"}, 
{16, 8, 0, 2, "女子"}, 
{16, 8, 30, 5, "男篮预赛第19场"}, 
{16, 9, 0, 1, "男子20公里竞走决赛出发"}, 
{16, 9, 50, 2, "男排B组"}, 
{16, 9, 59, 1, "女子800米自由泳决赛"}, 
{16, 9, 59, 1, "男子100米蝶泳决赛"}, 
{16, 9, 59, 1, "女子200米仰泳决赛"}, 
{16, 10, 26, 1, "男子20公里竞走决赛冲刺决赛"}, 
{16, 10, 30, 5, "羽毛球女单决赛"}, 
{16, 10, 35, 1, "男子100米蝶泳颁奖仪式"}, 
{16, 10, 35, 1, "男子50米自由泳决赛"}, 
{16, 10, 35, 1, "女子50米自由泳半决赛"}, 
{16, 11, 5, 1, "田径女子100米预赛"}, 
{16, 11, 50, 2, "射击：男子25米手枪速射决赛"}, 
{16, 13, 35, 5, "颁奖仪式"}, 
{16, 14, 15, 5, "乒乓球男团半决赛第一场"}, 
{16, 14, 20, 1, "男篮小组赛A组"}, 
{16, 14, 50, 2, "射击：男子飞碟双向决赛"}, 
{16, 15, 25, 1, "男篮小组赛A组"}, 
{16, 15, 40, 7, "篮球、射击、排球、游泳等"}, 
{16, 16, 25, 2, "录像：蹦床男女资格赛"}, 
{16, 16, 40, 0, "男子篮球A组"}, 
{16, 16, 49, 1, "女子双人双桨决赛"}, 
{16, 16, 49, 1, "男子双人双桨决赛"}, 
{16, 17, 19, 1, "女子双人双桨颁奖仪式"}, 
{16, 17, 29, 1, "男子4人单桨决赛"}, 
{16, 17, 44, 1, "女子自由式摔跤55公斤级决赛"}, 
{16, 17, 45, 0, "男子篮球A组"}, 
{16, 18, 0, 1, "场地自行车男子记分赛决赛"}, 
{16, 18, 25, 5, "羽毛球男单铜牌"}, 
{16, 18, 30, 2, "羽毛球混双半决赛"}, 
{16, 19, 35, 2, "举重：女子75以上公斤级"}, 
{16, 19, 36, 1, "男篮B组小组赛"}, 
{16, 21, 2, 1, "男篮B组小组赛"}, 
{16, 22, 0, 2, "男篮B组上半场"}, 
{16, 22, 15, 1, "全景奥运8"}, 
{16, 22, 21, 1, "男子100米决赛"}, 
{16, 22, 21, 1, "女子铅球决赛"}, 
{16, 22, 21, 1, "女子7项全能-800米"}, 
{16, 22, 30, 5, "奥运会荣誉殿堂8"}, 
{16, 23, 15, 2, "男篮B组下半场"}, 
{17, 1, 35, 7, "羽毛球、乒乓球等"}, 
{17, 4, 0, 7, "羽毛球、乒乓球等"}, 
{17, 5, 35, 7, "足球、垒球等"}, 
{17, 7, 15, 2, "女子马拉松决赛"}, 
{17, 9, 25, 5, "女垒预赛中国-中国"}, 
{17, 9, 35, 7, "羽毛球、田径、篮球等"}, 
{17, 9, 45, 1, "男子1500米自由泳"}, 
{17, 9, 45, 1, "女子50米自由泳"}, 
{17, 10, 36, 1, "女子4"}, 
{17, 10, 36, 0, "女子4"}, 
{17, 10, 36, 1, "男子4"}, 
{17, 10, 36, 1, "男子1500米自由泳接力颁奖仪式"}, 
{17, 11, 10, 5, "女沙1/4决赛"}, 
{17, 11, 10, 0, "女篮A组"}, 
{17, 12, 15, 0, "女篮A组"}, 
{17, 12, 30, 7, "举重、羽毛球、乒乓球等"}, 
{17, 13, 20, 5, "男子50米步枪3×40决赛"}, 
{17, 14, 4, 5, "男子10米气手枪决赛颁奖仪式"}, 
{17, 14, 15, 1, "女排小组赛B组"}, 
{17, 14, 25, 2, "女篮A组"}, 
{17, 14, 25, 5, "乒乓球女团铜牌决赛"}, 
{17, 15, 30, 2, "女篮A组"}, 
{17, 16, 0, 1, "网球女双决赛"}, 
{17, 16, 30, 7, "足球、射击、游泳等"}, 
{17, 16, 35, 5, "赛艇决赛"}, 
{17, 17, 37, 1, "网球女双决赛颁奖仪式"}, 
{17, 17, 50, 0, "羽毛球混合双打三、四名决赛和决赛"}, 
{17, 18, 6, 5, "体操四个单项决赛"}, 
{17, 18, 43, 5, "女子跳马决赛"}, 
{17, 19, 20, 5, "女子跳马颁奖仪式"}, 
{17, 19, 29, 5, "男子鞍马决赛"}, 
{17, 19, 35, 0, "跳水女子双人3米板、女排中国VS古"}, 
{17, 19, 36, 1, "乒乓球女团决赛"}, 
{17, 20, 6, 5, "男子鞍马颁奖仪式"}, 
{17, 20, 10, 5, "女子3米跳板决赛"}, 
{17, 20, 36, 2, "女排"}, 
{17, 21, 13, 1, "羽毛球男单决赛"}, 
{17, 21, 49, 5, "颁奖仪式"}, 
{17, 22, 15, 1, "全景奥运9"}, 
{17, 22, 15, 2, "女篮B组"}, 
{17, 22, 17, 1, "羽毛球男单决赛颁奖仪式"}, 
{17, 22, 30, 5, "奥运会荣誉殿堂9"}, 
{17, 22, 50, 7, "网球、体操等"}, 
{17, 23, 15, 2, "女篮B组"}, 
{18, 8, 42, 2, "女子曲棍球B组预赛"}, 
{18, 9, 0, 5, "男篮预赛第25场"}, 
{18, 9, 12, 1, "男子400米预赛"}, 
{18, 9, 12, 1, "男子三级跳"}, 
{18, 9, 12, 1, "女子链球"}, 
{18, 9, 12, 1, "男子200米预赛"}, 
{18, 9, 12, 1, "110米栏预赛"}, 
{18, 9, 58, 2, "女子铁人三项赛"}, 
{18, 11, 0, 5, "男沙1/4决赛一场"}, 
{18, 11, 59, 5, "女垒预赛"}, 
{18, 12, 33, 1, "男排小组赛"}, 
{18, 14, 28, 1, "男篮小组赛B组上半场"}, 
{18, 14, 30, 2, "男子排球A组第15场"}, 
{18, 14, 30, 5, "乒乓球男团铜牌决赛"}, 
{18, 16, 29, 1, "场地自行车2项决赛+1/4决赛"}, 
{18, 16, 45, 5, "男篮预赛"}, 
{18, 18, 0, 2, "体操单项决赛"}, 
{18, 19, 30, 5, "乒乓球男团决赛"}, 
{18, 20, 5, 1, "女子800米决赛"}, 
{18, 20, 5, 1, "男子200米第二轮"}, 
{18, 20, 5, 1, "400米栏半决赛"}, 
{18, 20, 5, 1, "女子铁饼决赛"}, 
{18, 20, 5, 1, "跳远决赛"}, 
{18, 20, 5, 1, "女子撑杆跳决赛"}, 
{18, 20, 5, 1, "男子3000米障碍决赛"}, 
{18, 20, 5, 1, "女子800米决赛"}, 
{18, 20, 25, 2, "蹦床：网上女子单人"}, 
{18, 22, 15, 2, "男篮A组"}, 
{18, 22, 34, 5, "颁奖仪式"}, 
{18, 23, 15, 2, "男篮A组"}, 
{19, 8, 39, 0, "男子曲棍球B组预赛"}, 
{19, 9, 1, 1, "女子沙排半决赛第1场"}, 
{19, 10, 0, 5, "男子跳水3米板半决赛"}, 
{19, 10, 0, 2, "女子排球1/4决赛第一场"}, 
{19, 10, 5, 1, "女子沙排半决赛第2场"}, 
{19, 11, 1, 1, "男子铁人三项决赛"}, 
{19, 11, 59, 5, "女排1/4决赛第一场"}, 
{19, 12, 0, 2, "女子手球1/4决赛第一场"}, 
{19, 14, 30, 1, "女篮1/4决赛第一场上半场"}, 
{19, 14, 59, 5, "乒乓球男女单打第1轮"}, 
{19, 15, 28, 1, "女篮1/4决赛第一场下半场"}, 
{19, 16, 25, 1, "女篮1/4决赛第二场"}, 
{19, 17, 10, 2, "男子500米皮艇预赛"}, 
{19, 17, 40, 2, "男子500米划艇预赛"}, 
{19, 17, 58, 2, "男足半决赛第一场上半场"}, 
{19, 17, 59, 5, "男子双杠决赛"}, 
{19, 18, 43, 5, "女子平衡木决赛"}, 
{19, 19, 0, 2, "男足半决赛第一场下半场"}, 
{19, 19, 19, 5, "女子平衡木颁奖仪式"}, 
{19, 19, 29, 5, "男子单杠决赛"}, 
{19, 20, 0, 2, "女子排球1/4决赛第3场"}, 
{19, 20, 6, 5, "男子单杠决赛颁奖"}, 
{19, 20, 14, 1, "蹦床男单决赛"}, 
{19, 20, 30, 5, "男子跳水3米板决赛"}, 
{19, 22, 0, 5, "颁奖仪式"}, 
{19, 22, 15, 2, "女篮1/4决赛上半场"}, 
{19, 22, 44, 1, "田径4项决赛"}, 
{19, 22, 44, 1, "男子110米栏第二轮"}, 
{19, 22, 44, 1, "男子1500米决赛"}, 
{19, 23, 15, 2, "女篮1/4决赛下半场"}, 
{20, 8, 59, 5, "10公里马拉松游泳女子决赛"}, 
{20, 9, 0, 2, "男子沙滩排球半决赛第51场"}, 
{20, 10, 0, 5, "乒乓球女子单打第2轮"}, 
{20, 10, 0, 2, "男子沙滩排球半决赛第52场"}, 
{20, 10, 10, 1, "男排1/4决赛第一场"}, 
{20, 12, 0, 5, "男排1/4决赛第二场"}, 
{20, 14, 15, 2, "男子手球1/4决赛第2场"}, 
{20, 14, 30, 5, "男篮1/4决赛第一场"}, 
{20, 16, 45, 5, "男篮1/4决赛第二场"}, 
{20, 16, 59, 1, "跆拳道女49公斤以下级半决赛"}, 
{20, 17, 0, 0, "女子垒球铜牌争夺战"}, 
{20, 19, 59, 5, "男篮1/4决赛第三场上半场"}, 
{20, 19, 59, 1, "跆拳道女子-49公斤以下级决赛"}, 
{20, 20, 0, 2, "男排1/4决赛第3场"}, 
{20, 20, 55, 5, "男篮1/4决赛第三场下半场"}, 
{20, 21, 27, 1, "男子110米栏半决赛"}, 
{20, 22, 15, 2, "男篮1/4决赛上半场"}, 
{20, 22, 44, 1, "女子200米半决赛"}, 
{20, 22, 44, 1, "女子200米半决赛"}, 
{20, 22, 44, 1, "女子400米栏决赛"}, 
{20, 23, 15, 2, "男篮1/4决赛下半场"}, 
{21, 8, 59, 1, "女子竞走20公里决赛"}, 
{21, 9, 0, 1, "女子跳高及格赛"}, 
{21, 9, 0, 2, "女子沙滩排球铜牌争夺战"}, 
{21, 9, 0, 1, "男子标枪及格赛"}, 
{21, 9, 0, 1, "男子十项全能-100米"}, 
{21, 10, 0, 2, "女子乒乓球单打1/4决赛"}, 
{21, 10, 0, 5, "女子10米板半决赛"}, 
{21, 10, 59, 1, "女子小轮车竞速决赛"}, 
{21, 11, 0, 2, "女子沙滩排球决赛"}, 
{21, 11, 19, 1, "男子小轮车竞速决赛"}, 
{21, 11, 25, 1, "男子小轮车竞速决赛颁奖仪式"}, 
{21, 12, 0, 5, "乒乓球女单第4轮比赛"}, 
{21, 12, 30, 2, "女子排球半决赛第1场"}, 
{21, 12, 49, 1, "录像:20日体操表演"}, 
{21, 13, 0, 5, "乒乓球男子单打第3轮"}, 
{21, 14, 58, 1, "跆拳道女子57公斤以下级1/4决赛"}, 
{21, 16, 9, 1, "男子500米双人皮艇半决赛"}, 
{21, 16, 59, 1, "女子水球铜牌战"}, 
{21, 18, 0, 5, "乒乓球女单1/4决赛"}, 
{21, 18, 15, 1, "男子摔跤自由式96公斤级决赛"}, 
{21, 18, 20, 2, "女子水球决赛"}, 
{21, 20, 0, 2, "女子排球半决赛第2场"}, 
{21, 20, 0, 5, "女子10米跳"}, 
{21, 20, 8, 1, "田径多项决赛"}, 
{21, 21, 19, 5, "颁奖仪式"}, 
{21, 21, 31, 5, "乒乓球男子单打第4轮"}, 
{21, 21, 34, 1, "男子110米栏决赛"}, 
{21, 22, 15, 2, "女篮半决赛第2场上半场"}, 
{21, 23, 15, 2, "女篮半决赛第2场下半场"}, 
{22, 7, 46, 2, "男子50公路竞走决赛"}, 
{22, 9, 4, 1, "男子沙滩排球铜牌战"}, 
{22, 10, 0, 5, "乒乓球女单半决赛"}, 
{22, 10, 20, 2, "男子50公路竞走决赛"}, 
{22, 10, 59, 1, "男子沙滩排球决赛"}, 
{22, 11, 0, 5, "乒乓球女单半决赛"}, 
{22, 12, 30, 2, "男排半决赛第1场"}, 
{22, 13, 29, 5, "乒乓球男单1/4决赛第一场"}, 
{22, 14, 29, 5, "乒乓球男单1/4决赛第二场"}, 
{22, 15, 0, 2, "女子山地自行车越野决赛"}, 
{22, 15, 29, 5, "乒乓球男单1/4决赛第三场"}, 
{22, 15, 49, 1, "500米四人皮艇决赛"}, 
{22, 16, 14, 1, "男子1000米双人皮艇决赛"}, 
{22, 16, 29, 5, "乒乓球男单1/4决赛第四场"}, 
{22, 16, 34, 1, "男子1000米双人划艇决赛"}, 
{22, 18, 0, 2, "女子曲棍球铜牌争夺战"}, 
{22, 19, 0, 5, "拳击48公斤级半决赛"}, 
{22, 19, 17, 5, "拳击48公斤级半决赛第二场"}, 
{22, 19, 31, 5, "乒乓球女单铜牌决赛"}, 
{22, 20, 0, 2, "男篮半决赛第一场上半场"}, 
{22, 20, 4, 1, "女子跳远比赛+径赛"}, 
{22, 20, 4, 1, "十项全能标枪比赛"}, 
{22, 20, 29, 5, "乒乓球女单决赛"}, 
{22, 20, 39, 1, "女子5000米"}, 
{22, 21, 0, 2, "男篮半决赛第一场下半场"}, 
{22, 21, 8, 1, "男子/女子4"}, 
{22, 21, 8, 1, "女子跳远比赛"}, 
{22, 21, 8, 1, "男子十项全能比赛"}, 
{22, 21, 8, 1, "男子撑杆跳高比赛"}, 
{22, 21, 26, 5, "颁奖仪式"}, 
{22, 22, 15, 2, "男篮半决赛第二场上半场"}, 
{22, 23, 15, 2, "男篮半决赛第二场下半场"}, 
{23, 9, 59, 1, "男子10米跳"}, 
{23, 10, 0, 5, "乒乓球男单半决赛"}, 
{23, 11, 0, 5, "乒乓球男单半决赛"}, 
{23, 11, 53, 5, "男足决赛上半场"}, 
{23, 13, 0, 5, "男足决赛下半场"}, 
{23, 15, 0, 5, "跆拳道女子67公斤级以上级1/4决赛"}, 
{23, 15, 45, 2, "女子手球决赛"}, 
{23, 16, 0, 5, "跆拳道男子80公斤级以上级1/4决赛"}, 
{23, 16, 34, 1, "男子500米双人划艇决赛"}, 
{23, 16, 49, 1, "皮划艇女子500米双人皮艇决赛"}, 
{23, 16, 58, 1, "男子500米双人划艇颁奖仪式"}, 
{23, 17, 0, 5, "跆拳道女子67公斤级以上级半决赛"}, 
{23, 17, 30, 5, "跆拳道男子80公斤级以上级半决赛"}, 
{23, 18, 0, 2, "艺术体操个人全能决赛"}, 
{23, 20, 0, 1, "女排决赛"}, 
{23, 20, 0, 2, "男子单人10米跳"}, 
{23, 20, 0, 5, "女子跆拳道67公斤以上级决赛"}, 
{23, 20, 30, 5, "乒乓球男单决赛"}, 
{23, 21, 16, 5, "颁奖仪式"}, 
{23, 21, 50, 1, "女排颁奖仪式"}, 
{23, 22, 0, 2, "女篮决赛上半场"}, 
{23, 23, 0, 2, "女篮决赛下半场"}, 
{24, 7, 14, 2, "男子马拉松决赛"}, 
{24, 11, 0, 2, "艺术体操集体全能决赛"}, 
{24, 12, 0, 2, "男篮铜牌争夺战上半场"}, 
{24, 12, 0, 5, "男排决赛"}, 
{24, 12, 43, 1, "录像:艺术体操集体全能比赛"}, 
{24, 13, 0, 2, "男篮铜牌争夺战下半场"}, 
{24, 13, 30, 1, "48公斤拳击决赛"}, 
{24, 13, 54, 1, "48公斤拳击颁奖仪式"}, 
{24, 14, 6, 1, "54公斤级拳击决赛"}, 
{24, 14, 28, 5, "男篮决赛上半场"}, 
{24, 14, 41, 1, "60公斤级拳击决赛"}, 
{24, 15, 16, 1, "69公斤级拳击决赛"}, 
{24, 15, 26, 5, "男篮决赛下半场"}, 
{24, 15, 45, 2, "男子手球决赛"}, 
{24, 15, 51, 1, "81公斤级拳击决赛"}, 
{24, 16, 26, 1, "91公斤以上级拳击决赛"}, 
{24, 20, 0, 1, "闭幕式"}, 
{0, 0, 0, 0, ""}
};

void getfile() {
	char buf[1024];
	
	sprintf(buf, "cd " MY_BBS_HOME "/bbstmpfs/tmp/; "
			"/usr/bin/wget -c -q \"" FEED "\" -O " MEDAL " "
			"> /dev/null");
	system(buf);
	return;
}

inline char *newstrstr(char *start, char *tag, int num) {
	int i;
	char *ptr;
	
	ptr = start;
	if (!ptr)
		return NULL;
	for (i = 0; i < num; i++) {
		if (!(ptr = strcasestr(ptr, tag)))
			return NULL;
		ptr++;
	}
	return ptr;
}

int medaltable(char *ptr, FILE *fp) {
    char *start, *end, *tmp, buf[256];
    struct medallist ml;
    int i, total = 0;
    time_t now = time(NULL) + 28800;

    if (NULL == fp)
	return 0;
    if (!(start = strstr(ptr, "_medalNArray")))
	return 0;
    if (!(end = strstr(start, "]];")))
	return 0;
    if (!(start = strstr(start, "[[")))
    	return 0;
    if (start >= end)
	return 0;
    fprintf(fp, "\033[0;33m╭═ \033[1;33m奥运奖牌榜 "
	    "\033[0;33m═════════════════╮\n");
    fprintf(fp, "\033[0;33m│                   "
	    "\033[1;33m金牌    \033[1;37m银牌    \033[0;33m铜牌    "
	    "\033[1;32m总计 \033[0;33m│\n");
    start++;
    for (i = 0; i < 8 && start && start + 8 < end; i++) {
	start += 8;
	bzero(&ml, sizeof(struct medallist));
	bzero(buf, sizeof(buf));
	strncpy(ml.name, start, sizeof(ml.name));
	if ((tmp = strchr(ml.name, '\"')))
	    *tmp = 0;
	if (!(start = newstrstr(start, "\"", 2)))
	    break;
	ml.order = atoi(start);
	if (!(start = newstrstr(start, "\"", 2)))
	    break;
	strncpy(ml.gold, start, sizeof(ml.gold));
	if ((tmp = strchr(ml.gold, '\"')))
	    *tmp = 0;
	total += atoi(ml.gold);
	if (!(start = newstrstr(start, "\"", 2)))
	    break;
	strncpy(ml.silver, start, sizeof(ml.silver));
	if ((tmp = strchr(ml.silver, '\"')))
	    *tmp = 0;
	if (!(start = newstrstr(start, "\"", 2)))
	    break;
	strncpy(ml.copper, start, sizeof(ml.copper));
	if ((tmp = strchr(ml.copper, '\"')))
	    *tmp = 0;
	if (!(start = newstrstr(start, "\"", 2)))
	    break;
	strncpy(ml.total, start, sizeof(ml.total));
	if ((tmp = strchr(ml.total, '\"')))
	    *tmp = 0;
	fprintf(fp, "\033[0;33m│ \033[1;37m%d \033[1;%dm%-14s"
		"  \033[1;33m%4s    \033[1;37m%4s    \033[0;33m%4s"
		"    \033[1;32m%4s \033[0;33m│\n", ml.order, 
		strcmp(ml.name, "中国") ? 37 : 31, ml.name, 
		ml.gold, ml.silver, ml.copper, ml.total);
	start = strchr(start, '[');
    }
    while(start && start < end) {
	if (!(start = newstrstr(start, "\"", 7)))
	    break;
	if (start >= end)
	    break;
	total += atoi(start);
    }
    strncpy(buf, asctime(gmtime(&now)), sizeof(buf));
    if ((tmp = strchr(buf, '\n')))
	*tmp = 0;
    fprintf(fp, "\033[0;33m│ "
	    "        \033[1;30m最后更新时间：%s\033[0;33m │ \n", 
	    buf);
    fprintf(fp, "\033[0;33m╰════════════════"
	    "\033[1;33m 金牌总数%4d \033[0;33m═╯", total);
    fprintf(fp, "\n\n");
    return 1;
}

int tvtable (FILE *fp) {
    int i, count = 0, bi = 0;
    time_t now_t = time(NULL) + 28800;
    struct tm *now;
    
    now = gmtime(&now_t);

    if (!fp)
	return 0;

    for (i = 0; tvlist[i].date && count < 16; i++) {
	if (tvlist[i].date < now->tm_mday)
	    continue;
	if (tvlist[i].hour < now->tm_hour)
	    continue;
	if (tvlist[i].hour == now->tm_hour && 
		tvlist[i].minute < now->tm_min)
	    continue;
	fprintf(fp, "\033[%d;36m%02d:%02d %-32s", 
		bi, tvlist[i].hour, tvlist[i].minute, 
		tvlist[i].title);
	if (!(count % 2))
	    fprintf(fp, "  ");
	else {
	    fprintf(fp, "\n");
	    bi = (++bi) % 2;
	}
	count++;
    }
    return 1;
}

int main (void) {
	struct mmapfile mf = { ptr:NULL, size:0 };
	char *ptr;
	FILE *fp;

	getfile();
	if (!file_exist(MEDAL))
		return 0;
	if (NULL == (fp = fopen(MEDALPOST, "w")))
		return 0;

	if (mmapfile(MEDAL, &mf) < 0) {
		fclose(fp);
		return 0;
	}
	if (mf.size <= 0) {
		fclose(fp);
		return 0;
	}
	ptr = mf.ptr;
	MMAP_TRY {
	    medaltable(ptr, fp);
	    tvtable(fp);
	} MMAP_CATCH {
	} MMAP_END mmapfile(NULL, &mf);
	fclose(fp);
	unlink(MEDAL);
	return 1;
}
